api-server/app/controllers/dogs_controller.rb

  def index
    dogs = Dog.all # TODO: paginate
---
SELECT "dogs".* FROM "dogs"

  def create
    # reject unless bearer token matches ENV['API_KEY']
    authenticate_or_request_with_http_token do |token|
      dog = Dog.new(
        name: params[:name],
        description: params[:description]
      )
      dog.save
---
INSERT INTO "dogs" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Zeus"], ["description", "A tiny little old chihuahua."], ["created_at", "2023-06-16 16:23:18.186532"], ["updated_at", "2023-06-16 16:23:18.186532"]]

  def destroy
    authenticate_or_request_with_http_token do |token|
      dog = Dog.find_by(id: params[:id])
      dog.destroy
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "dogs" WHERE "dogs"."id" = $1  [["id", 4]]